In [1]:
import pandas as pd
import numpy as np

In [13]:
df = pd.read_csv('transportation_modes_and_earnings.csv')
df.head(20)

                          Transportation Mode      Earnings Bracket     Value
0            Car, Truck, or Van - Drove Alone  $1 to $9,999 or loss   9330559
1            Car, Truck, or Van - Drove Alone    $10,000 to $14,999   5144909
2            Car, Truck, or Van - Drove Alone    $15,000 to $24,999  10731449
3            Car, Truck, or Van - Drove Alone    $25,000 to $34,999  12977755
4            Car, Truck, or Van - Drove Alone    $35,000 to $49,999  19305876
5            Car, Truck, or Van - Drove Alone    $50,000 to $64,999  16430128
6            Car, Truck, or Van - Drove Alone    $65,000 to $74,999   7673675
7            Car, Truck, or Van - Drove Alone       $75,000 or more  30773302
8              Car, Truck, or Van - Carpooled  $1 to $9,999 or loss   1969381
9              Car, Truck, or Van - Carpooled    $10,000 to $14,999    914582
10             Car, Truck, or Van - Carpooled    $15,000 to $24,999   1912526
11             Car, Truck, or Van - Carpooled    $25,000 to $34,999   2128969
12             Car, Truck, or Van - Carpooled    $35,000 to $49,999   2594555
13             Car, Truck, or Van - Carpooled    $50,000 to $64,999   1792437
14             Car, Truck, or Van - Carpooled    $65,000 to $74,999    737250
15             Car, Truck, or Van - Carpooled       $75,000 or more   2558210
16  Public Transportation (excluding taxicab)  $1 to $9,999 or loss    589616
17  Public Transportation (excluding taxicab)    $10,000 to $14,999    315881
18  Public Transportation (excluding taxicab)    $15,000 to $24,999    629959
19  Public Transportation (excluding taxicab)    $25,000 to $34,999    661479

Now let's Breakdown each bracket to see the most popular way each goes to work

Workers who earn up to and not including $10K in 2024
--Drive alone, Carpooled, or worked from home.
Least of all Public Transportation

In [5]:
df_1 = df[df['Earnings Bracket']== '$1 to $9,999 or loss'].sort_values(by="Value", ascending=False)
df_1.head(10)

,Transportation Mode,Earnings Bracket,Value
0,"Car, Truck, or Van - Drove Alone","$1 to $9,999 or loss",9330559
8,"Car, Truck, or Van - Carpooled","$1 to $9,999 or loss",1969381
32,Worked from Home,"$1 to $9,999 or loss",1512479
24,"Taxicab, Motorcycle, Bicycle, Walked, or Other...","$1 to $9,999 or loss",1372898
16,Public Transportation (excluding taxicab),"$1 to $9,999 or loss",589616

Workers who earned between 10K and 14.9K last year
Mainly drove alone and carpooled.
Public transportation is lowest.

In [7]:
df_2 = df[df['Earnings Bracket']== '$10,000 to $14,999'].sort_values(by="Value", ascending=False)
df_2.head(10)

,Transportation Mode,Earnings Bracket,Value
1,"Car, Truck, or Van - Drove Alone","$10,000 to $14,999",5144909
9,"Car, Truck, or Van - Carpooled","$10,000 to $14,999",914582
33,Worked from Home,"$10,000 to $14,999",813935
25,"Taxicab, Motorcycle, Bicycle, Walked, or Other...","$10,000 to $14,999",548786
17,Public Transportation (excluding taxicab),"$10,000 to $14,999",315881

Workers who earned under 25K last year either Drove alone or carpooled.
Working from home is sstill the 3rd highest mode of transport.
Public transportation is lowest again

In [8]:
df_3 = df[df['Earnings Bracket'] == '$15,000 to $24,999'].sort_values(by="Value", ascending=False)
df_3.head()

,Transportation Mode,Earnings Bracket,Value
2,"Car, Truck, or Van - Drove Alone","$15,000 to $24,999",10731449
10,"Car, Truck, or Van - Carpooled","$15,000 to $24,999",1912526
34,Worked from Home,"$15,000 to $24,999",1424288
26,"Taxicab, Motorcycle, Bicycle, Walked, or Other...","$15,000 to $24,999",939471
18,Public Transportation (excluding taxicab),"$15,000 to $24,999",629959

Workers who made under 35K in 2024, Drove alone, Carpooled or worked from home.
Public transportation trailing behind once again.

In [9]:
df_4 = df[df['Earnings Bracket'] == '$25,000 to $34,999'].sort_values(by="Value", ascending=False)
df_4.head(10)

,Transportation Mode,Earnings Bracket,Value
3,"Car, Truck, or Van - Drove Alone","$25,000 to $34,999",12977755
11,"Car, Truck, or Van - Carpooled","$25,000 to $34,999",2128969
35,Worked from Home,"$25,000 to $34,999",1526800
27,"Taxicab, Motorcycle, Bicycle, Walked, or Other...","$25,000 to $34,999",900105
19,Public Transportation (excluding taxicab),"$25,000 to $34,999",661479

Pretty much the same across the board for workers who earn under $49K

In [12]:
df_5 = df[df['Earnings Bracket'] == '$35,000 to $49,999'].sort_values(by="Value", ascending=False)
df_5.head()

,Transportation Mode,Earnings Bracket,Value
4,"Car, Truck, or Van - Drove Alone","$35,000 to $49,999",19305876
12,"Car, Truck, or Van - Carpooled","$35,000 to $49,999",2594555
36,Worked from Home,"$35,000 to $49,999",2582735
28,"Taxicab, Motorcycle, Bicycle, Walked, or Other...","$35,000 to $49,999",954867
20,Public Transportation (excluding taxicab),"$35,000 to $49,999",778592

Starting at $50k/year income, we're seeing the shift from Carpooling to working from home.
Public transport still at the bottom.

In [14]:
df_6 = df[df['Earnings Bracket'] == '$50,000 to $64,999'].sort_values(by="Value", ascending=False)
df_6.head()

,Transportation Mode,Earnings Bracket,Value
5,"Car, Truck, or Van - Drove Alone","$50,000 to $64,999",16430128
37,Worked from Home,"$50,000 to $64,999",2662464
13,"Car, Truck, or Van - Carpooled","$50,000 to $64,999",1792437
29,"Taxicab, Motorcycle, Bicycle, Walked, or Other...","$50,000 to $64,999",665880
21,Public Transportation (excluding taxicab),"$50,000 to $64,999",596128

Work from home replaces Carpooling once we reach certain earnings bracket.

In [16]:
df_7 = df[df['Earnings Bracket'] == '$65,000 to $74,999'].sort_values(by="Value", ascending=False)
df_7.head()

,Transportation Mode,Earnings Bracket,Value
6,"Car, Truck, or Van - Drove Alone","$65,000 to $74,999",7673675
38,Worked from Home,"$65,000 to $74,999",1456119
14,"Car, Truck, or Van - Carpooled","$65,000 to $74,999",737250
30,"Taxicab, Motorcycle, Bicycle, Walked, or Other...","$65,000 to $74,999",295260
22,Public Transportation (excluding taxicab),"$65,000 to $74,999",294617

The interesting part: People who earn 75K or more ride public transportation more than any earnings bracket.

In [18]:
df_8 = df[df['Earnings Bracket'] == '$75,000 or more'].sort_values(by="Value", ascending=False)
df_8.head()

,Transportation Mode,Earnings Bracket,Value
7,"Car, Truck, or Van - Drove Alone","$75,000 or more",30773302
39,Worked from Home,"$75,000 or more",10502520
15,"Car, Truck, or Van - Carpooled","$75,000 or more",2558210
23,Public Transportation (excluding taxicab),"$75,000 or more",1868704
31,"Taxicab, Motorcycle, Bicycle, Walked, or Other...","$75,000 or more",1548455

Let's drill down on only Public Transporation numbers.